# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

municipalitys_list = [
    ['г. Ростов-на-Дону','ростова-на-дону'],['г. Азов','города азова'],['г. Батайск','города батайск'],['г. Волгодонск','город волгодонск'],
    ['г. Гуково','г.гуково'],['г. Донецк','город донецк'],['г. Зверево','города зверево'],['г. Каменск-Шахтинский','каменск-шахтинский'],
    ['г. Новочеркасск','новочеркасск'],['г. Новошахтинск','новошахтинска'],['г. Таганрог','таганрог'],['г. Шахты','г. шахты'],
    ['Азовский район','азовского'],['Аксайский район','аксайского'],['Багаевский район','багаевского'],
    ['Белокалитвинский район','белокалитвинского'],['Боковский район','боковского'],['Верхнедонской район','верхнедонского'],
    ['Веселовский район','веселовского'],['Волгодонской район','волгодонского'],['Дубовский район','дубовского'],
    ['Егорлыкский район','егорлыкского'],['Заветинский район','заветинского'],['Зерноградский район','зерноградского'],
    ['Зимовниковский район','зимовниковского'],['Кагальницкий район','кагальницкого'],['Каменский район','каменского'],
    ['Кашарский район','кашарского'],['Константиновский район','константиновского'],['Красносулинский район','красносулинского'],
    ['Куйбышевский район','куйбышевского'],['Мартыновский район','мартыновского'],['Матвеево-Курганский район','матвеево-курганского'],
    ['Миллеровский район','миллеровского'],['Милютинский район','милютинского'],['Морозовский район','морозовского'],
    ['Мясниковский район','мясниковскому'],['Неклиновский район','неклиновского'],['Обливский район','обливский'],
    ['Октябрьский район','октябрьского'],['Орловский район','орловского'],['Песчанокопский район','песчанокопского'],
    ['Пролетарский район','пролетарского'],['Ремонтненский район','ремонтненского'],['Родионово – Несветайский район',''],
    ['Cальский район','сальского'],['Семикаракорский район','семикаракорского'],['Советский (с) район','советский'],
    ['Тарасовский район','тарасовского'],['Тацинский район','тацинского'],['Усть-Донецкий район','усть-донецкого'],
    ['Целинский район','целинского'],['Цимлянский район','цимлянского'],['Чертковский район','чертковского'],['Шолоховский район','шолоховского']
]

municipalitys_list.each do |m_name, filt|
    Municipality.find_or_create_by({name: m_name}) do |c_municipality|
        c_municipality.filt_string = filt
    end
end